content/softwares/tmux.org
# -*- coding:utf-8-*-
#+TITLE: tmux
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 概述

* 核心概念
  tmux 采用 C/S 模型构建，输入 tmux 命令就相当于开启了一个服务器，此时默认将新建一个会话，然后会话中默认新建一个窗口，窗口中默认新建一个面板。会话、窗口、面板之间的联系如下：
  + 一个session（会话）可以包含多个 window（窗口），窗口默认充满会话界面，因此这些窗口中可以运行相关性不大的任务。
  + 一个 window 又可以包含多个 pane（面板），窗口下的面板，都处于同一界面下，这些面板适合运行相关性高的任务，以便同时观察到它们的运行情况。

** session
   + 会话共享

** window

** panel

* 使用

** 新建会话
   #+BEGIN_SRC sh
tmux
tmux new -s <session-name>
   #+END_SRC

** 查看所有会话
   #+BEGIN_SRC sh
tmux ls
   #+END_SRC
   快捷键 =Ctrl-b s=

** 断开会话
   #+BEGIN_SRC sh
tmux detach
   #+END_SRC
   快捷键 =Ctrl-b d=

** 重连会话会话
   #+BEGIN_SRC sh
tmux a
tmux a -t <session-name>
   #+END_SRC

** 关闭会话
   #+BEGIN_SRC sh
tmux kill-session -t <session_name>
   #+END_SRC

** 关闭所有会话
   #+BEGIN_SRC sh
tmux kill-server
   #+END_SRC

* 快捷键
  tmux 的所有指令，都包含同一个前缀，默认为 Ctrl+b。
  |      | 指令        |    描述                                                           |
  |------+-------------+--------------------------------------------------------------------|
  | 系统 | ?           |    显示快捷键帮助文档                                             |
  |      | d           |    断开当前会话                                                   |
  |      | D           |    选择要断开的会话                                               |
  |      | Ctrl+z      |    挂起当前会话                                                   |
  |      | r           |    强制重载当前会话                                               |
  |      | s           |    显示会话列表用于选择并切换                                     |
  |      | :           |    进入命令行模式，此时可直接输入 ls 等命令                       |
  |      | [           |    进入复制模式，按 q 退出                                        |
  |      | ]           |    粘贴复制模式中复制的文本                                       |
  |      | ~           |    列出提示信息缓存                                               |
  |------+-------------+--------------------------------------------------------------------|
  | 窗口 | c           |    新建窗口                                                       |
  |      | &           |    关闭当前窗口（关闭前需输入 y or n 确认）                       |
  |      | 0~9         |    切换到指定窗口                                                 |
  |      | p           |    切换到上一窗口                                                 |
  |      | n           |    切换到下一窗口                                                 |
  |      | w           |    打开窗口列表，用于且切换窗口                                   |
  |      | ,           |    重命名当前窗口                                                 |
  |      | .           |    修改当前窗口编号（适用于窗口重新排序）                         |
  |      | f           |    快速定位到窗口（输入关键字匹配窗口名称）                       |
  |------+-------------+--------------------------------------------------------------------|
  | 面板 | "           |    当前面板上下一分为二，下侧新建面板                             |
  |      | %           |    当前面板左右一分为二，右侧新建面板                             |
  |      | x           |    关闭当前面板（关闭前需输入 y or n 确认）                       |
  |      | z           |    最大化当前面板，再重复一次按键后恢复正常（v1.8 版本新增）      |
  |      | !           |    将当前面板移动到新的窗口打开（原窗口中存在两个及以上面板有效） |
  |      | ;           |    切换到最后一次使用的面板                                       |
  |      | q           |    显示面板编号，在编号消失前输入对应的数字可切换到相应的面板     |
  |      | {           |    向前置换当前面板                                               |
  |      | }           |    向后置换当前面板                                               |
  |      | Ctrl+o      |    顺时针旋转当前窗口中的所有面板                                 |
  |      | 方向键      |    移动光标切换面板                                               |
  |      | o           |    选择下一面板                                                   |
  |      | 空格键      |    在自带的面板布局中循环切换                                     |
  |      | Alt+方向键  |    以 5 个单元格为单位调整当前面板边缘                            |
  |      | Ctrl+方向键 |    以 1 个单元格为单位调整当前面板边缘（Mac 下被系统快捷键覆盖）  |
  |      | t           |    显示时钟                                                       |
  |      |             |                                                                    |

* 配置f
  用户配置文件为 =..tmux.conf=

* Footnotes

[fn:1] http://louiszhai.github.io/2017/09/30/tmux/
