linux/tools/tmux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tmux</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">tmux</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org153243b">1. 概述</a></li>
<li><a href="#org7a59fd6">2. 核心概念</a>
<ul>
<li><a href="#orgc72c379">2.1. session</a></li>
<li><a href="#org9981847">2.2. window</a></li>
<li><a href="#orgb699fe8">2.3. panel</a></li>
</ul>
</li>
<li><a href="#org4349784">3. 使用</a>
<ul>
<li><a href="#orgb749b3a">3.1. 新建会话</a></li>
<li><a href="#org0a59d52">3.2. 查看所有会话</a></li>
<li><a href="#org9a57e0d">3.3. 断开会话</a></li>
<li><a href="#orgc56de63">3.4. 重连会话会话</a></li>
<li><a href="#orgce0c367">3.5. 关闭会话</a></li>
<li><a href="#org65b075d">3.6. 关闭所有会话</a></li>
</ul>
</li>
<li><a href="#orga6ea351">4. 快捷键</a></li>
<li><a href="#org7d36969">5. 配置f</a></li>
</ul>
</div>
</div>

<div id="outline-container-org153243b" class="outline-2">
<h2 id="org153243b"><span class="section-number-2">1</span> 概述</h2>
</div>

<div id="outline-container-org7a59fd6" class="outline-2">
<h2 id="org7a59fd6"><span class="section-number-2">2</span> 核心概念</h2>
<div class="outline-text-2" id="text-2">
<p>
tmux 采用 C/S 模型构建，输入 tmux 命令就相当于开启了一个服务器，此时默认将新建一个会话，然后会话中默认新建一个窗口，窗口中默认新建一个面板。会话、窗口、面板之间的联系如下：
</p>
<ul class="org-ul">
<li>一个session（会话）可以包含多个 window（窗口），窗口默认充满会话界面，因此这些窗口中可以运行相关性不大的任务。</li>
<li>一个 window 又可以包含多个 pane（面板），窗口下的面板，都处于同一界面下，这些面板适合运行相关性高的任务，以便同时观察到它们的运行情况。</li>
</ul>
</div>

<div id="outline-container-orgc72c379" class="outline-3">
<h3 id="orgc72c379"><span class="section-number-3">2.1</span> session</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>会话共享</li>
</ul>
</div>
</div>

<div id="outline-container-org9981847" class="outline-3">
<h3 id="org9981847"><span class="section-number-3">2.2</span> window</h3>
</div>

<div id="outline-container-orgb699fe8" class="outline-3">
<h3 id="orgb699fe8"><span class="section-number-3">2.3</span> panel</h3>
</div>
</div>

<div id="outline-container-org4349784" class="outline-2">
<h2 id="org4349784"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb749b3a" class="outline-3">
<h3 id="orgb749b3a"><span class="section-number-3">3.1</span> 新建会话</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">tmux
tmux new -s &lt;session-name&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a59d52" class="outline-3">
<h3 id="org0a59d52"><span class="section-number-3">3.2</span> 查看所有会话</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh">tmux ls
</pre>
</div>
<p>
快捷键 <code>Ctrl-b s</code>
</p>
</div>
</div>

<div id="outline-container-org9a57e0d" class="outline-3">
<h3 id="org9a57e0d"><span class="section-number-3">3.3</span> 断开会话</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sh">tmux detach
</pre>
</div>
<p>
快捷键 <code>Ctrl-b d</code>
</p>
</div>
</div>

<div id="outline-container-orgc56de63" class="outline-3">
<h3 id="orgc56de63"><span class="section-number-3">3.4</span> 重连会话会话</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-sh">tmux a
tmux a -t &lt;session-name&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce0c367" class="outline-3">
<h3 id="orgce0c367"><span class="section-number-3">3.5</span> 关闭会话</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-sh">tmux kill-session -t &lt;session_name&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org65b075d" class="outline-3">
<h3 id="org65b075d"><span class="section-number-3">3.6</span> 关闭所有会话</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-sh">tmux kill-server
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga6ea351" class="outline-2">
<h2 id="orga6ea351"><span class="section-number-2">4</span> 快捷键</h2>
<div class="outline-text-2" id="text-4">
<p>
tmux 的所有指令，都包含同一个前缀，默认为 Ctrl+b。
</p>
<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">系统</td>
<td class="org-left">?</td>
<td class="org-left">显示快捷键帮助文档</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">d</td>
<td class="org-left">断开当前会话</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">D</td>
<td class="org-left">选择要断开的会话</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ctrl+z</td>
<td class="org-left">挂起当前会话</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">r</td>
<td class="org-left">强制重载当前会话</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">s</td>
<td class="org-left">显示会话列表用于选择并切换</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">:</td>
<td class="org-left">进入命令行模式，此时可直接输入 ls 等命令</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">[</td>
<td class="org-left">进入复制模式，按 q 退出</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">]</td>
<td class="org-left">粘贴复制模式中复制的文本</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">~</td>
<td class="org-left">列出提示信息缓存</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">窗口</td>
<td class="org-left">c</td>
<td class="org-left">新建窗口</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&amp;</td>
<td class="org-left">关闭当前窗口（关闭前需输入 y or n 确认）</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">0~9</td>
<td class="org-left">切换到指定窗口</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">p</td>
<td class="org-left">切换到上一窗口</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">n</td>
<td class="org-left">切换到下一窗口</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">w</td>
<td class="org-left">打开窗口列表，用于且切换窗口</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">,</td>
<td class="org-left">重命名当前窗口</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">.</td>
<td class="org-left">修改当前窗口编号（适用于窗口重新排序）</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f</td>
<td class="org-left">快速定位到窗口（输入关键字匹配窗口名称）</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">面板</td>
<td class="org-left">"</td>
<td class="org-left">当前面板上下一分为二，下侧新建面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">%</td>
<td class="org-left">当前面板左右一分为二，右侧新建面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">x</td>
<td class="org-left">关闭当前面板（关闭前需输入 y or n 确认）</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">z</td>
<td class="org-left">最大化当前面板，再重复一次按键后恢复正常（v1.8 版本新增）</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">!</td>
<td class="org-left">将当前面板移动到新的窗口打开（原窗口中存在两个及以上面板有效）</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">;</td>
<td class="org-left">切换到最后一次使用的面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">q</td>
<td class="org-left">显示面板编号，在编号消失前输入对应的数字可切换到相应的面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">{</td>
<td class="org-left">向前置换当前面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">}</td>
<td class="org-left">向后置换当前面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ctrl+o</td>
<td class="org-left">顺时针旋转当前窗口中的所有面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">方向键</td>
<td class="org-left">移动光标切换面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">o</td>
<td class="org-left">选择下一面板</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">空格键</td>
<td class="org-left">在自带的面板布局中循环切换</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Alt+方向键</td>
<td class="org-left">以 5 个单元格为单位调整当前面板边缘</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ctrl+方向键</td>
<td class="org-left">以 1 个单元格为单位调整当前面板边缘（Mac 下被系统快捷键覆盖）</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">t</td>
<td class="org-left">显示时钟</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7d36969" class="outline-2">
<h2 id="org7d36969"><span class="section-number-2">5</span> 配置f</h2>
<div class="outline-text-2" id="text-5">
<p>
用户配置文件为 <code>..tmux.conf</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-10 二 19:57</p>
<p class="validation"></p>
</div>
</body>
</html>
